W11D4/todo_app/app/controllers/api/todos_controller.rb

    def index
        render json: Todo.all
---
SELECT "todos".* FROM "todos"

    def create
        @todo = Todo.new(todo_params)
        if @todo.save
---
INSERT INTO "todos" ("title", "body", "done", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "asdf"], ["body", "asdf"], ["done", false], ["created_at", "2021-07-22 23:46:19.570329"], ["updated_at", "2021-07-22 23:46:19.570329"]]